In [1]:
import os

In [16]:
import pandas as pd
import numpy as np

In [3]:
from osgeo import gdal #conda install -c conda-forge gdal

In [4]:
import rasterio #conda install rasterio

In [5]:
!gdalinfo --version

GDAL 2.2.2, released 2017/09/15

In [6]:
data=pd.read_csv("data/species3.csv", encoding="euc-kr")

In [7]:
data.shape

(82, 3)

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   species  82 non-null     object
 1   lon      82 non-null     float64
 2   lat      82 non-null     float64
dtypes: float64(2), object(1)
memory usage: 2.0+ KB

In [9]:
data.head()

  species         lon        lat
0     백부자  128.341556  36.905056
1     백부자  128.344111  36.905611
2     백부자  128.343833  36.905500
3     백부자  128.343861  36.904472
4     백부자  128.343639  36.904528

In [12]:
data.describe(include='all')

       species         lon        lat
count       82   82.000000  82.000000
unique       3         NaN        NaN
top        솔붓꽃         NaN        NaN
freq        42         NaN        NaN
mean       NaN  127.679018  36.221649
std        NaN    1.054257   1.267241
min        NaN  126.037661  33.238050
25%        NaN  126.546303  35.300722
50%        NaN  128.343986  36.701556
75%        NaN  128.523028  37.259833
max        NaN  129.000194  37.798278

In [14]:
data.groupby('species').size()

species
백부자     26
솔붓꽃     42
지네발란    14
dtype: int64

# 파이썬을 이용하여 지리정보활용관련 참고사이트

#### http://geospatialpython.com/2013/12/python-and-elevation-data-ascii-grid.html
#### https://github.com/PacktPublishing/Learning-Geospatial-Analysis-with-Python-Third-Edition.git

- ncols        250
- nrows        250
- xllcorner    277750.0
- yllcorner    6122250.0
- cellsize     1.0
- NODATA_value      -9999

In [34]:
altArray  = np.loadtxt("data/alt_110.asc", skiprows=6)
altArray.shape

(1234, 1929)

In [31]:
import linecache
lines =[]
lines.append(linecache.getline("data/alt_110.asc", 1))
lines.append (linecache.getline("data/alt_110.asc", 2))
lines.append ( linecache.getline("data/alt_110.asc", 3))
lines.append ( linecache.getline("data/alt_110.asc", 4))
lines.append ( linecache.getline("data/alt_110.asc", 5))
lines.append ( linecache.getline("data/alt_110.asc", 6))

In [33]:
for line in lines:
    print(line)

ncols         1929

nrows         1234

xllcorner     120

yllcorner     32.948310202094

cellsize      0.0083333333333333

NODATA_value  -9999

In [42]:
header = "ncols     %s\n" % altArray.shape[1]
header += "nrows    %s\n" % altArray.shape[0]
header += "xllcorner 120.0\n"
header += "yllcorner 32.948310202094\n"
header += "cellsize 0.0083333333333333\n"
header += "NODATA_value -9999\n"

In [38]:
f = open("data/myGrid.asc", "w")
f.write(header)
np.savetxt(f, altArray, fmt="%1.2f")
f.close()

In [40]:
with open("data/myGrid1.asc", "w") as f:
    f.write(header)
    np.savetxt(f, altArray, fmt="%1.2f")

In [43]:
with open("data/altArray.asc", "w") as f:
    f.write(header)
    np.savetxt(f, altArray, fmt="%1.2f")